app/controllers/admin/classifieds_controller.rb

SELECT * FROM `classifieds` WHERE (parent_id IS NULL) ORDER BY position
---
  def index
		@classifieds = Classified.find_main

INSERT INTO `classifieds` (`position`, `created_at`, `title`, `updated_at`, `parent_id`, `description`, `two_liner`) VALUES(NULL, '2010-04-16 12:54:12', 'test', '2010-04-16 12:54:12', NULL, '<p>test</p>', '<p>test</p>')
---
	def create
    @classified = Classified.new(params[:classified])

      if @classified.save

SELECT * FROM `classifieds` WHERE (parent_id IS NULL) ORDER BY position
---
  def edit
	 @classified = Classified.find_by_id(params[:id])

SELECT * FROM `classifieds` WHERE (`classifieds`.`id` = '1') LIMIT 1
---
  def show
	 @parent = Classified.find_by_id(params[:id])

SELECT * FROM `classifieds` WHERE (`classifieds`.`id` = '2') LIMIT 1
UPDATE `classifieds` SET `updated_at` = '2010-04-16 13:25:08', `two_liner` = '<p>Soleat ornatus ocurreret nec ex, sit ad exerci perpetua patrioque.&nbsp;</p>', `title` = 'Blad ib lansdñasd', `description` = '<p>Soleat ornatus ocurreret nec ex, sit ad exerci perpetua patrioque. Eligendi reprimique pro at, zzril libris pericula vel eu. Dictas suscipit nominati in sed, qui ut posse aliquando scripserit. Sit no nibh mundi bonorum, per accumsan volutpat et, erat zzril maiestatis mea in. Ut mea movet vidisse electram, eam eu nusquam recusabo necessitatibus, eam invenire vulputate pertinacia id. Tempor latine tincidunt duo in, odio exerci suscipiantur mea ut.</p>' WHERE `id` = 2
---
	def update
			      @classified = Classified.find_by_id(params[:id])
       respond_to do |format|
         if @classified.update_attributes(params[:classified])