app/controllers/admin/egalleries_controller.rb

SELECT * FROM `events` WHERE (`events`.`id` IS NULL) LIMIT 1
---
  def index
		@event = Event.find_by_id(params[:event_id])

SELECT * FROM `egalleries` WHERE (`egalleries`.`id` = '2') LIMIT 1
---
  def show
		@egallery = Egallery.find_by_id(params[:id])

SELECT * FROM `events` WHERE (`events`.`id` = '13') LIMIT 1
---
  def new
		@event = Event.find_by_id(params[:event_id])

INSERT INTO `egalleries` (`created_at`, `title`, `event_id`, `updated_at`, `description`) VALUES('2010-04-12 18:16:39', 'test', NULL, '2010-04-12 18:16:39', '<p>test</p>')
---
	def create
	 @egallery = Egallery.new(params[:egallery])
	 respond_to do |format|
		 if @egallery.save

SELECT * FROM `events` WHERE (`events`.`id` = '13') LIMIT 1
SELECT * FROM `egalleries` WHERE (`egalleries`.`id` = '6') LIMIT 1
---
  def edit
		@event = Event.find_by_id(params[:event_id])
		@egallery = Egallery.find_by_id(params[:id])

SELECT * FROM `egalleries` WHERE (`egalleries`.`id` = 2)
DELETE FROM `egalleries` WHERE `id` = 2
---
	 def destroy
     @egallery = Egallery.find(params[:id])
     @egallery.destroy