app/controllers/admin/events_controller.rb

SELECT * FROM `events` WHERE (('2010-03-27 23:00:00' <= end_at) AND (start_at < '2010-05-01 22:00:00')) ORDER BY start_at ASC
SELECT * FROM `events` ORDER BY start_at asc
---
  def index
		@events = Event.find(:all, :order => "start_at asc")
		@events.each do |event|

INSERT INTO `events` (`name`, `created_at`, `title`, `end_at`, `updated_at`, `start_at`, `location_id`, `description`, `two_liner`, `state`) VALUES('dancefloor', '2010-04-11 15:19:54', 'Dancefloor', '2010-04-13 00:00:00', '2010-04-11 15:19:54', '2010-04-13 00:00:00', 2, '<p>Basically, it\'s like the AVP Tour, if the players were replaced with women who get paid handsomely to have pictures taken of them in their underwear. Eight of the top modeling agencies will be trotting out two-person teams, so expect to see all of your favorite leggy beauties from Next, CGM and Wilhelmina vying for the glory that is the Model Beach Volleyball Tournament Cup (the final is 2pm Sunday and attendance is free).<br /></p>', '<p>Basically, it\'s like the AVP Tour, if the players were replaced with women who get paid handsomely to have pictures taken of them in their underwear.&nbsp;</p>', 'open')
---
	def create
	 @event = Event.new(params[:event])

	 respond_to do |format|
		 if @event.save

SELECT * FROM `events` WHERE (`events`.`id` = '3') LIMIT 1
---
	def show
			@event = Event.find_by_id(params[:id])

SELECT * FROM `events` WHERE (`events`.`id` = '3') LIMIT 1
---
	def edit
		@event = Event.find_by_id(params[:id])

SELECT * FROM `events` WHERE (`events`.`id` = 3)
UPDATE `events` SET `updated_at` = '2010-04-08 17:17:57', `two_liner` = '<p>&nbsp;</p>\r\n<div id=\"_mcePaste\" style=\"position: absolute; left: -10000px; top: 0px; width: 1px; height: 1px; overflow-x: hidden; overflow-y: hidden;\">Lorem ipsum mei ea assum aeque, duo no sale dicunt. Cu per facete maiorum principes, cu per graece denique similique, sint labore ius id. Usu facete dolorum mediocritatem ex. Ea duo sumo molestiae dissentiunt, ad veniam facilisis intellegat vis. Melius mnesarchum an cum, ei simul regione quo. Aperiam repudiandae ea est, id labores singulis sed.</div>\r\n<p>rum principes, cu per graece denique similique, sint labore ius id. Usu facete dolorum mediocritatem ex. Ea</p>', `description` = '<h1>Lorem ipsum mei ea assum aeque</h1>\r\n<p>, duo no sale dicunt. Cu per facete maiorum principes, cu per graece denique similique, sint labore ius id. Usu facete dolorum mediocritatem ex. Ea duo sumo molestiae dissentiunt, ad veniam facilisis intellegat vis. Melius mnesarchum an cum, ei simul regione quo. Aperiam repudiandae ea est,</p>\r\n<h5>id labores singulis sed.</h5>' WHERE `id` = 7
---
   def update
     @event = Event.find(params[:id])
	   @events = Event.find(:all)
     respond_to do |format|
       if @event.update_attributes(params[:event])

SELECT * FROM `events` WHERE (`events`.`id` = 2)
DELETE FROM `events` WHERE `id` = 2
---
   def destroy
     @event = Event.find(params[:id])
     @event.destroy