app/controllers/admin/locations_controller.rb

INSERT INTO `locations` (`address`, `created_at`, `photo_file_size`, `title`, `updated_at`, `photo_file_name`, `door_price`, `photo_content_type`, `photo_updated_at`, `description`) VALUES('Santa Escolastica, 15 18009 Granada', '2010-04-10 19:28:12', 567908, 'Paddy\'s Pub', '2010-04-10 19:28:12', 'outside1.jpg', NULL, 'image/jpeg', '2010-04-10 19:28:10', '<p>﻿Darts</p>')
---
	def create
	 @location = Location.new(params[:location])

	 respond_to do |format|
		 if @location.save

SELECT * FROM `locations` WHERE (`locations`.`id` = '2') LIMIT 1
---
  def edit
		@location = Location.find_by_id(params[:id])

SELECT * FROM `locations` WHERE (`locations`.`id` = '2') LIMIT 1
UPDATE `locations` SET `updated_at` = '2010-04-10 14:43:32', `photo_file_name` = 'hotelgeneric.jpg', `photo_updated_at` = '2010-04-10 14:43:31', `photo_file_size` = 82845, `photo_content_type` = 'image/jpeg' WHERE `id` = 2
---
  def update
		@location = Location.find_by_id(params[:id])
     respond_to do |format|
       if @location.update_attributes(params[:location])

SELECT * FROM `locations` WHERE (`locations`.`id` = 1)
DELETE FROM `locations` WHERE `id` = 1
---
   def destroy
     @location = Location.find(params[:id])
     @location.destroy

SELECT * FROM `locations` WHERE (`locations`.`id` = '1') LIMIT 1
---
  def show
		@location = Location.find_by_id(params[:id])