app/controllers/admin/overview_controller.rb

SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def index
		@pages = Page.find(:all)
		@events = Event.find(:all)
		@locations = Location.find(:all)
		@users = User.find(:all)