app/controllers/admin/posts_controller.rb

SELECT * FROM `posts` WHERE (parent_id IS NULL) ORDER BY position
---
 def index
		@posts = Post.find_main

INSERT INTO `posts` (`position`, `created_at`, `title`, `author`, `updated_at`, `date`, `user_id`, `parent_id`, `description`) VALUES(NULL, '2010-04-13 13:26:16', 'TEST', NULL, '2010-04-13 13:26:16', NULL, NULL, NULL, '<p>TEST</p>')
---
	def create
    @post = Post.new(params[:post])

      if @post.save

SELECT * FROM `posts` WHERE (parent_id IS NULL) ORDER BY position
---
  def edit
	 @post = Post.find_by_id(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = '4') LIMIT 1
UPDATE `posts` SET `updated_at` = '2010-04-14 12:56:33', `two_liner` = '<p>Lorem ipsum inermis scaevola abhorreant cu vel, at tale minim zzril eum. Vis ut modus ipsum insolens, eu qui prompta aliquam eligendi.</p>' WHERE `id` = 4
---
	def update
			      @post = Post.find_by_id(params[:id])
       respond_to do |format|
         if @post.update_attributes(params[:post])

SELECT * FROM `posts` WHERE (`posts`.`id` = '1') LIMIT 1
---
  def show
	 @parent = Post.find_by_id(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = '1') LIMIT 1
DELETE FROM `posts` WHERE `id` = 1
---
	def destroy

	 @post = Post.find_by_id(params[:id])
	 @post.destroy