app/controllers/admin/roles_controller.rb

INSERT INTO `roles` (`name`) VALUES('Admin')
---
	def create
	 @role = Role.new(params[:role])

	 respond_to do |format|
		 if @role.save