app/controllers/admin/uploads_controller.rb

SELECT * FROM `uploads` WHERE (`uploads`.`id` = 10)
DELETE FROM `uploads` WHERE `id` = 10
---
 def destroy
     @upload = Upload.find(params[:id])
     @upload.destroy