app/controllers/admin/users_controller.rb

  def index
		@users = User.find(:all)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

	def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `remember_token`, `login`, `email`) VALUES('', 'ca392cf71de4b610ac784f7835d0069104a79fba', '2010-04-10 12:40:37', NULL, 'a61993699c2fc609b76226ef25bd7b91788dd8ca', NULL, '2010-04-10 12:40:37', '16aa4de3169e6d2aabc3e670cbd5c107f2a07e30', NULL, 'master', 'omargallob@gmail.com')