app/controllers/calendar_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`name` = 'whatson') LIMIT 1
---
  def index
		@page = Page.find_by_name("whatson")