app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `remember_token`, `login`, `email`) VALUES('', 'a1e0650cfba1db42f7de762350d16a2294b3da3f', '2010-04-10 11:57:09', NULL, '37301c0a6e444711ff02d6433144fe211e88fe90', NULL, '2010-04-10 11:57:09', 'deb03f30e2dd9b27d348a8dfc15c6a01916c3696', NULL, 'master', 'omargallob@gmail.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save