app/controllers/viewer_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`name` = 'home') LIMIT 1
SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
SELECT * FROM `posts` WHERE (parent_id = 2) ORDER BY date DESC
SELECT * FROM `events` WHERE (end_at < '2010-04-17 13:38:20' and start_at > '2010-04-15 13:38:20') ORDER BY start_at asc
SELECT * FROM `locations` WHERE (`locations`.`id` = 2)
SELECT * FROM `classifieds` WHERE (parent_id > 0) ORDER BY created_at DESC
---
  def show
		@page = Page.find_by_name(params[:name])
		@news = Post.find_sub(3).paginate :page => 1,:per_page => 1
		if @page.name == "whatson"
		  if params[:type] and params[:filter]
        if params[:type] == "events"
          title = params[:filter].gsub(/-/," ").capitalize
  		    @event_type = EventType.find_by_title(title)
  		    @events = @event_type.events.sort_by(&:start_at).paginate :page => params[:page],:per_page => 6
        else
          title = params[:filter].gsub(/-/," ").capitalize
          @location_type = LocationType.find_by_title(title)
          @locations = @location_type.locations.paginate :page => params[:page],:per_page => 6
        end
		  else
		    @events = Event.find(:all, :order =>"start_at asc", :conditions => ["start_at > ?",Time.now], :include => "location").paginate :page => params[:page],:per_page => 6
		  end

		end
		if @page.name == "home"
			@articles = Post.find_sub(2).paginate :page => 1,:per_page => 3
			@events = Event.find(:all, :order =>"start_at asc", :conditions => ["end_at < ? and start_at > ?",Time.now + 1.day,Time.now - 1.day], :include => "location")
			@classifieds = Classified.find_all_sub